// src/constants/casinos.ts

export interface Casino {
  slug: string;
  name: string;
  logo: string; // путь в папке public
  rank: number; // место в рейтинге
  rating: number; // от 0 до 5
  bonus: string; // текст бонуса
  advantages: string[];
  url: string;
}

export const casinos: Casino[] = [
  {
    slug: "spinsofglory",
    name: "Spins of Glory",
    logo: "/spinsofglory.png",
    rank: 1,
    rating: 4.9,
    bonus: "100% έως €500 + 200 Δωρεάν Περιστροφές στην πρώτη κατάθεση",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (11.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος και τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://spinsofglory1.com/gr/",
  },
  {
    slug: "casinova",
    name: "Casinova",
    logo: "/casinova.png",
    rank: 2,
    rating: 4.8,
    bonus: "Έως €2.000 + 350 Δωρεάν Περιστροφές σε 4 καταθέσεις",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (9.200+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος και τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://casinova3.com/gr/",
  },
  {
    slug: "kinbet",
    name: "Kinbet",
    logo: "/kinbet.png",
    rank: 3,
    rating: 4.8,
    bonus:
      "250% έως €3.000 + 350 Δωρεάν Περιστροφές + 1 Bonus Crab, κατανεμημένο σε 4 καταθέσεις",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (10.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος και τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://kinbet4.com/gr/",
  },
  {
    slug: "royalgame",
    name: "Royal Game",
    logo: "/royalgame.png",
    rank: 4,
    rating: 4.8,
    bonus: "100% έως €500 + 200 Δωρεάν Περιστροφές στην πρώτη κατάθεση",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (9.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος και τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://royalgame059413.com/gr/",
  },
  {
    slug: "winshark",
    name: "Winshark",
    logo: "/winshark.png",
    rank: 5,
    rating: 4.7,
    bonus:
      "240% έως €2.500 + 300 Δωρεάν Περιστροφές, κατανεμημένο σε 3 καταθέσεις",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (7.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος και τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://winshark1.com/el-gr",
  },
  {
    slug: "trueluck",
    name: "True Luck",
    logo: "/trueluck.png",
    rank: 6,
    rating: 4.7,
    bonus: "100% έως €500 + 100 Δωρεάν Περιστροφές στην πρώτη κατάθεση",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (7.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος και τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://trueluck.com/el",
  },
  {
    slug: "abuking",
    name: "Abu King",
    logo: "/abuking.png",
    rank: 7,
    rating: 4.7,
    bonus:
      "100% έως €500 + 200 Δωρεάν Περιστροφές + 1 Bonus Crab στην πρώτη κατάθεση",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (11.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος και τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://abuking1.com/gr/",
  },
  {
    slug: "romibet",
    name: "Romibet",
    logo: "/romibet.png",
    rank: 8,
    rating: 4.6,
    bonus: "100% έως €500 + 100 Δωρεάν Περιστροφές στην πρώτη κατάθεση",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (7.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος и τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://romibet1.com/gr/",
  },
  {
    slug: "snatch",
    name: "Snatch Casino",
    logo: "/snatch.svg",
    rank: 9,
    rating: 4.6,
    bonus: "450% έως €6.000 + 325 Δωρεάν Περιστροφές σε 4 καταθέσεις",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (7.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος и τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://snatchcasino.io/",
  },
  {
    slug: "hugocasino",
    name: "Hugo Casino",
    logo: "/hugo.png",
    rank: 10,
    rating: 4.5,
    bonus: "100% έως €150 + 100 Δωρεάν Περιστροφές στην πρώτη κατάθεση",
    advantages: [
      "Μεγάλη ποικιλία παιχνιδιών (4.000+ τίτλοι)",
      "Ελκυστικά μπόνους καλωσορίσματος и τακτικές προσφορές",
      "Υποστήριξη κρυπτονομισμάτων",
      "Ζωντανή υποστήριξη 24/7",
    ],
    url: "https://hugocasino07.com/el-gr",
  },
];
